# base desktop
archinstall
base
bluez-utils
cpupower
cups
distrobox
dolphin
ecryptfs-utils
flatpak
framework-system
intel-ucode
mesa
nvidia-open
nvidia-utils
nvidia-prime
pacman-contrib
pacutils
plasma-meta
podman
vulkan-radeon
wireguard-tools

# dev tools
android-tools
atool
base-devel
bash-completion
binutils
bloaty
bpftrace
clang
cmake
code
curl
fd
fzf
gcc
gdb
git
git-filter-repo
git-lfs
github-cli
glibc-locales
htop
imagemagick
jq
less
lftp
libqalculate
lsof
ltrace
man-pages
meson
moreutils
mtr
ncdu
neovim
nmap
numactl
openssh
patchelf
perf
pkgconf
postgresql
progress
python
rclone
ripgrep
rizin
rsync
ruff
rustup
rz-cutter
skopeo
socat
strace
sudo
tcpdump
time
traceroute
tree
uv
wget
which
wireshark-cli
wl-clipboard
yt-dlp
